Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 30, 80, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 30, 80, 32)   832         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 15, 40, 32)   0           conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 15, 40, 48)   38448       max_pooling2d[0][0]              
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 7, 20, 48)    0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 20, 64)    76864       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 3, 10, 64)    0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 3, 10, 64)    0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
flatten (Flatten)               (None, 1920)         0           dropout[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 512)          983552      flatten[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           dense[0][0]                      
__________________________________________________________________________________________________
digit0 (Dense)                  (None, 62)           31806       dropout_1[0][0]                  
__________________________________________________________________________________________________
digit1 (Dense)                  (None, 62)           31806       dropout_1[0][0]                  
__________________________________________________________________________________________________
digit2 (Dense)                  (None, 62)           31806       dropout_1[0][0]                  
__________________________________________________________________________________________________
digit3 (Dense)                  (None, 62)           31806       dropout_1[0][0]                  
==================================================================================================
Total params: 1,226,920
Trainable params: 1,226,920
Non-trainable params: 0
__________________________________________________________________________________________________
